TestCases/TemporalMoistureFluxBC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
        #include "interpolationTable.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
        vectorField U(mesh.nCells(), vector::zero);
        
        // Ux component data (streamwise velocity - u)
        List<Tuple2<scalar, scalar>> uData =
        {
            {0.0, 0.0},
            {12.5, -2.7453194199934687},
            {37.5, -3.5763553412284907},
            {62.5, -4.182153746322876},
            {87.5, -4.834673341361351},
            {112.5, -5.442077473292439},
            {137.5, -5.94797986942928},
            {162.5, -6.2384010287335006},
            {187.5, -6.3367507609113485},
            {212.5, -6.287815849300366},
            {237.5, -6.042966974789277},
            {262.5, -5.753047005589488},
            {287.5, -5.4232316702713765},
            {312.5, -5.103046227580565},
            {337.5, -4.7858048156795645},
            {362.5, -4.528257492750702},
            {387.5, -4.282413562905506},
            {412.5, -4.104468668683942},
            {437.5, -3.9517508805973898},
            {462.5, -3.829040753145184},
            {487.5, -3.745808711373351},
            {512.5, -3.662576669601518},
            {537.5, -3.6192664530941734},
            {562.5, -3.5789623010438336},
            {587.5, -3.5455714779663756},
            {612.5, -3.5384773795975066},
            {637.5, -3.531383281228637},
            {662.5, -3.5323903797981235},
            {687.5, -3.5577346679953044},
            {712.5, -3.5830789561924856},
            {737.5, -3.609024700352814},
            {762.5, -3.650529905083842},
            {787.5, -3.69203510981487},
            {812.5, -3.7335403145458974},
            {837.5, -3.744296854485949},
            {862.5, -3.7300386739037408},
            {887.5, -3.7157804933215326},
            {912.5, -3.7015223127393244},
            {937.5, -3.6110749402352766},
            {962.5, -3.4981713639511582},
            {987.5, -3.38526778766704},
            {1012.5, -3.272364211382921},
            {1037.5, -3.134927931443687},
            {1062.5, -2.985956849063287},
            {1087.5, -2.836985766682887},
            {1112.5, -2.688014684302487},
            {1137.5, -2.5563379699037942},
            {1162.5, -2.4746902972192104},
            {1187.5, -2.3930426245346266},
            {1212.5, -2.3113949518500423},
            {1237.5, -2.2297472791654585},
            {1262.5, -2.1990755376217432},
            {1287.5, -2.2223170248448643},
            {1312.5, -2.245558512067985},
            {1337.5, -2.268799999291106},
            {1362.5, -2.2920414865142265},
            {1387.5, -2.327531251849531},
            {1412.5, -2.3857971707102315},
            {1437.5, -2.444063089570932},
            {1462.5, -2.5023290084316323},
            {1487.5, -2.5605949272923327},
            {1512.5, -2.618860846153033},
            {1537.5, -2.678364132883076},
            {1562.5, -2.7381223044997514},
            {1587.5, -2.797880476116427},
            {1612.5, -2.8576386477331024},
            {1637.5, -2.917396819349778},
            {1662.5, -2.9771549909664534},
            {1687.5, -3.0143243178839683},
            {1712.5, -3.0491508334834867},
            {1737.5, -3.0839773490830047},
            {1762.5, -3.118803864682523},
            {1787.5, -3.1536303802820416},
            {1812.5, -3.1884568958815596},
            {1837.5, -3.1966402681712798},
            {1862.5, -3.184184636850533},
            {1887.5, -3.171729005529786},
            {1912.5, -3.159273374209039},
            {1937.5, -3.146817742888292},
            {1962.5, -3.1343621115675453},
            {1987.5, -3.1219064802467984},
            {2012.5, -3.0678872265199297},
            {2037.5, -3.0026695483572747},
            {2062.5, -2.9374518701946197},
            {2087.5, -2.8722341920319647},
            {2112.5, -2.8070165138693097},
            {2137.5, -2.7417988357066547},
            {2162.5, -2.6765811575439997},
            {2187.5, -2.5946553511029364},
            {2212.5, -2.500064475584925},
            {2237.5, -2.405473600066913},
            {2262.5, -2.310882724548901},
            {2287.5, -2.216291849030889},
            {2312.5, -2.1217009735128776},
            {2337.5, -2.027110097994866},
            {2362.5, -1.932519222476854},
            {2387.5, -1.8407288251352623},
            {2412.5, -1.7492470115870942},
            {2437.5, -1.657765198038926},
            {2462.5, -1.5662833844907582},
            {2487.5, -1.4748015709425901},
            {2512.5, -1.383319757394422},
            {2537.5, -1.291837943846254},
            {2562.5, -1.200356130298086},
            {2587.5, -1.1238076518625832},
            {2612.5, -1.0514294702290896},
            {2637.5, -0.9790512885955961},
            {2662.5, -0.9066731069621025},
            {2687.5, -0.8342949253286088},
            {2712.5, -0.7619167436951152},
            {2737.5, -0.6895385620616216},
            {2762.5, -0.6171603804281279},
            {2787.5, -0.5479704099751979},
            {2812.5, -0.49047186443493807},
            {2837.5, -0.4329733188946782},
            {2862.5, -0.37547477335441837},
            {2887.5, -0.3179762278141585},
            {2912.5, -0.2604776822738987},
            {2937.5, -0.20297913673363888},
            {2962.5, -0.14548059119337903},
            {2987.5, -0.08798204565311918},
            {3012.5, -0.03127524628320405},
            {3037.5, 0.02237198003865723},
            {3062.5, 0.07601920636051851},
            {3087.5, 0.1296664326823798},
            {3112.5, 0.18331365900424107},
            {3137.5, 0.23696088532610235},
            {3162.5, 0.29060811164796363},
            {3187.5, 0.3442553379698249},
            {3212.5, 0.3979025642916862},
            {3237.5, 0.45154979061354744},
            {3262.5, 0.4993847617850049},
            {3287.5, 0.5454498539125577},
            {3312.5, 0.5915149460401107},
            {3337.5, 0.6375800381676635},
            {3362.5, 0.6836451302952165},
            {3387.5, 0.7297102224227693},
            {3412.5, 0.7757753145503221},
            {3437.5, 0.8218404066778751},
            {3462.5, 0.8679054988054279},
            {3487.5, 0.9139705909329808},
            {3512.5, 0.9314306940645883},
            {3537.5, 0.9461077762449772},
            {3562.5, 0.9607848584253661},
            {3587.5, 0.9754619406057549},
            {3612.5, 0.9901390227861437},
            {3637.5, 1.0048161049665325},
            {3662.5, 1.0194931871469215},
            {3687.5, 1.0341702693273103},
            {3712.5, 1.048847351507699},
            {3737.5, 1.063524433688088},
            {3762.5, 1.043243144142299},
            {3787.5, 1.0048196503243985},
            {3812.5, 0.9663961565064981},
            {3837.5, 0.9279726626885977},
            {3862.5, 0.8895491688706973},
            {3887.5, 0.8511256750527969},
            {3912.5, 0.8127021812348965},
            {3937.5, 0.7742786874169961},
            {3962.5, 0.7358551935990957},
            {3987.5, 0.6974316997811952}
        };
        
        // Uy component data (spanwise velocity - v, now it's y-direction)
        List<Tuple2<scalar, scalar>> vData =
        {
            {0.0, 0.0},
            {12.5, 0.35587862761708977},
            {37.5, 0.5520144545948612},
            {62.5, 0.766474988127744},
            {87.5, 1.0896232600471036},
            {112.5, 1.52638612423528},
            {137.5, 2.068191936319321},
            {162.5, 2.6825686695768094},
            {187.5, 3.269788626568509},
            {212.5, 3.812915443598284},
            {237.5, 4.207354008874825},
            {262.5, 4.499239022802233},
            {287.5, 4.700347198357583},
            {312.5, 4.778510448040276},
            {337.5, 4.81908723012374},
            {362.5, 4.763451671245451},
            {387.5, 4.688953091502555},
            {412.5, 4.577199774577298},
            {437.5, 4.4516048883234145},
            {462.5, 4.324515747387635},
            {487.5, 4.195460764626362},
            {512.5, 4.066405781865089},
            {537.5, 3.9402741132945294},
            {562.5, 3.8143625666955265},
            {587.5, 3.688845134555927},
            {612.5, 3.564826823821262},
            {637.5, 3.4408085130865964},
            {662.5, 3.3200468053092758},
            {687.5, 3.2090684128022913},
            {712.5, 3.098090020295307},
            {737.5, 2.988227898588242},
            {762.5, 2.9072433216421834},
            {787.5, 2.8262587446961254},
            {812.5, 2.745274167750067},
            {837.5, 2.68490374570397},
            {862.5, 2.6413033956961374},
            {887.5, 2.5977030456883043},
            {912.5, 2.5541026956804713},
            {937.5, 2.5406378350272436},
            {962.5, 2.5360551881485547},
            {987.5, 2.531472541269866},
            {1012.5, 2.5268898943911773},
            {1037.5, 2.5227497217908827},
            {1062.5, 2.518817592032434},
            {1087.5, 2.5148854622739854},
            {1112.5, 2.5109533325155367},
            {1137.5, 2.4899639184177027},
            {1162.5, 2.4196312967133715},
            {1187.5, 2.3492986750090408},
            {1212.5, 2.27896605330471},
            {1237.5, 2.208633431600379},
            {1262.5, 2.1202929386786846},
            {1287.5, 2.0129069382239844},
            {1312.5, 1.905520937769284},
            {1337.5, 1.7981349373145838},
            {1362.5, 1.6907489368598834},
            {1387.5, 1.5814152966880721},
            {1412.5, 1.4684599440761297},
            {1437.5, 1.3555045914641872},
            {1462.5, 1.2425492388522448},
            {1487.5, 1.1295938862403023},
            {1512.5, 1.0166385336283599},
            {1537.5, 0.9035171542142544},
            {1562.5, 0.7903615750090474},
            {1587.5, 0.6772059958038403},
            {1612.5, 0.5640504165986333},
            {1637.5, 0.4508948373934263},
            {1662.5, 0.3377392581882192},
            {1687.5, 0.22198655286288344},
            {1712.5, 0.1059644855338889},
            {1737.5, -0.01005758179510563},
            {1762.5, -0.12607964912410016},
            {1787.5, -0.2421017164530947},
            {1812.5, -0.3581237837820892},
            {1837.5, -0.47491254851084463},
            {1862.5, -0.5922952322910349},
            {1887.5, -0.709677916071225},
            {1912.5, -0.8270605998514152},
            {1937.5, -0.9444432836316055},
            {1962.5, -1.0618259674117956},
            {1987.5, -1.179208651191986},
            {2012.5, -1.2950773987397768},
            {2037.5, -1.41053824871951},
            {2062.5, -1.5259990986992433},
            {2087.5, -1.6414599486789765},
            {2112.5, -1.7569207986587099},
            {2137.5, -1.872381648638443},
            {2162.5, -1.9878424986181764},
            {2187.5, -2.100125477857436},
            {2212.5, -2.209999572524166},
            {2237.5, -2.319873667190896},
            {2262.5, -2.429747761857626},
            {2287.5, -2.539621856524356},
            {2312.5, -2.649495951191086},
            {2337.5, -2.759370045857816},
            {2362.5, -2.8692441405245455},
            {2387.5, -2.9741768988528765},
            {2412.5, -3.0785651729125125},
            {2437.5, -3.182953446972148},
            {2462.5, -3.2873417210317837},
            {2487.5, -3.3917299950914193},
            {2512.5, -3.496118269151055},
            {2537.5, -3.600506543210691},
            {2562.5, -3.7048948172703264},
            {2587.5, -3.798599286662191},
            {2612.5, -3.889320187005136},
            {2637.5, -3.9800410873480807},
            {2662.5, -4.070761987691026},
            {2687.5, -4.16148288803397},
            {2712.5, -4.2522037883769155},
            {2737.5, -4.342924688719861},
            {2762.5, -4.433645589062805},
            {2787.5, -4.519366068238432},
            {2812.5, -4.5867496038120015},
            {2837.5, -4.654133139385571},
            {2862.5, -4.721516674959142},
            {2887.5, -4.788900210532712},
            {2912.5, -4.856283746106283},
            {2937.5, -4.923667281679853},
            {2962.5, -4.991050817253424},
            {2987.5, -5.0584343528269935},
            {3012.5, -5.124187105533165},
            {3037.5, -5.183637965669213},
            {3062.5, -5.243088825805262},
            {3087.5, -5.302539685941309},
            {3112.5, -5.361990546077357},
            {3137.5, -5.421441406213405},
            {3162.5, -5.480892266349453},
            {3187.5, -5.5403431264855},
            {3212.5, -5.599793986621548},
            {3237.5, -5.659244846757596},
            {3262.5, -5.731352020423239},
            {3287.5, -5.807313144665634},
            {3312.5, -5.8832742689080275},
            {3337.5, -5.959235393150421},
            {3362.5, -6.035196517392816},
            {3387.5, -6.111157641635209},
            {3412.5, -6.187118765877603},
            {3437.5, -6.263079890119997},
            {3462.5, -6.339041014362391},
            {3487.5, -6.415002138604785},
            {3512.5, -6.5090433721723215},
            {3537.5, -6.604843645852035},
            {3562.5, -6.700643919531747},
            {3587.5, -6.796444193211459},
            {3612.5, -6.892244466891172},
            {3637.5, -6.988044740570884},
            {3662.5, -7.083845014250596},
            {3687.5, -7.179645287930309},
            {3712.5, -7.275445561610021},
            {3737.5, -7.371245835289734},
            {3762.5, -7.452216027120929},
            {3787.5, -7.525489911573296},
            {3812.5, -7.598763796025664},
            {3837.5, -7.672037680478032},
            {3862.5, -7.745311564930399},
            {3887.5, -7.818585449382767},
            {3912.5, -7.891859333835135},
            {3937.5, -7.9651332182875025},
            {3962.5, -8.038407102739871},
            {3987.5, -8.111680987192239}
        };
        
        // Linear interpolation function
        auto interpolate = [&](const List<Tuple2<scalar, scalar>>& data, scalar z) -> scalar
        {
            if (z <= data.first().first()) 
                return data.first().second();
            if (z >= data.last().first()) 
                return data.last().second();
                
            for (label i = 0; i < data.size() - 1; ++i)
            {
                if (z >= data[i].first() && z <= data[i+1].first())
                {
                    scalar z1 = data[i].first();
                    scalar z2 = data[i+1].first();
                    scalar val1 = data[i].second();
                    scalar val2 = data[i+1].second();
                    
                    return val1 + (val2 - val1) * (z - z1) / (z2 - z1);
                }
            }
            
            return data.last().second();
        };
        
        // Assign velocity vector to each cell based on its z-coordinate (vertical)
        forAll(U, i)
        {
            const scalar z = mesh.C()[i].z(); // Now using z as vertical coordinate
            
            // Ux (streamwise), Uy (spanwise), Uz (vertical = 0)
            U[i] = vector
            (
                interpolate(uData, z),  // Ux component from u data (streamwise)
                interpolate(vData, z),  // Uy component from v data (spanwise)
                0.0                     // Uz component = 0 (no vertical velocity)
            );
        }
        
        U.writeEntry("", os);
    #};
};

boundaryField
{
    earth
    {
        type            noSlip;
    }
	cblTop
    {
        type            slip;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
