TestCases/TemporalMoistureFluxBC/0/sh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      sh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
        #include "interpolationTable.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
        scalarField sh(mesh.nCells(), scalar(0));
        
        // Specific humidity (kg/kg) profile data (z vs sh)
        List<Tuple2<scalar, scalar>> profileData =
        {
            {12.5, 0.009130094115766754},
            {37.5, 0.009008949687821247},
            {62.5, 0.008918045880243124},
            {87.5, 0.008772591593692815},
            {112.5, 0.008571921010983084},
            {137.5, 0.008351347222185971},
            {162.5, 0.008152919131216827},
            {187.5, 0.00798789018958873},
            {212.5, 0.007847682576612332},
            {237.5, 0.0077338606165510545},
            {262.5, 0.00762187657708317},
            {287.5, 0.0075115194010291035},
            {312.5, 0.007394508074571606},
            {337.5, 0.007275462455061639},
            {362.5, 0.007142068124262428},
            {387.5, 0.0070058606404131635},
            {412.5, 0.006854935445175395},
            {437.5, 0.0066985420534624905},
            {462.5, 0.0065361292718672205},
            {487.5, 0.006365797379468374},
            {512.5, 0.006195465487069526},
            {537.5, 0.006003539670898457},
            {562.5, 0.005809987858763805},
            {587.5, 0.005610238807783567},
            {612.5, 0.0053869168754150775},
            {637.5, 0.0051635949430465875},
            {662.5, 0.004933475046801904},
            {687.5, 0.004682933065130081},
            {712.5, 0.004432391083458259},
            {737.5, 0.004182332620723272},
            {762.5, 0.0039447826279243176},
            {787.5, 0.003707232635125362},
            {812.5, 0.0034696826423264073},
            {837.5, 0.0032976775264539197},
            {862.5, 0.0031789946211270652},
            {887.5, 0.003060311715800211},
            {912.5, 0.002941628810473356},
            {937.5, 0.0029627716558401182},
            {962.5, 0.0030251271124982363},
            {987.5, 0.003087482569156354},
            {1012.5, 0.003149838025814472},
            {1037.5, 0.003313042884742145},
            {1062.5, 0.003523665180730262},
            {1087.5, 0.0037342874767183785},
            {1112.5, 0.003944909772706495},
            {1137.5, 0.004126825290755221},
            {1162.5, 0.004225698017501799},
            {1187.5, 0.004324570744248376},
            {1212.5, 0.004423443470994954},
            {1237.5, 0.004522316197741532},
            {1262.5, 0.0045087440587784815},
            {1287.5, 0.004376247838724954},
            {1312.5, 0.004243751618671425},
            {1337.5, 0.004111255398617898},
            {1362.5, 0.00397875917856437},
            {1387.5, 0.003822379526998417},
            {1412.5, 0.0036215876978301967},
            {1437.5, 0.0034207958686619765},
            {1462.5, 0.003220004039493756},
            {1487.5, 0.003019212210325536},
            {1512.5, 0.0028184203811573156},
            {1537.5, 0.002682148606937035},
            {1562.5, 0.0025591672916808385},
            {1587.5, 0.002436185976424642},
            {1612.5, 0.002313204661168445},
            {1637.5, 0.0021902233459122488},
            {1662.5, 0.0020672420306560523},
            {1687.5, 0.0020093857573578013},
            {1712.5, 0.0019582839545699317},
            {1737.5, 0.001907182151782062},
            {1762.5, 0.0018560803489941925},
            {1787.5, 0.0018049785462063226},
            {1812.5, 0.001753876743418453},
            {1837.5, 0.0017200363003634013},
            {1862.5, 0.00169956730007337},
            {1887.5, 0.0016790982997833385},
            {1912.5, 0.001658629299493307},
            {1937.5, 0.0016381602992032755},
            {1962.5, 0.001617691298913244},
            {1987.5, 0.0015972222986232127},
            {2012.5, 0.001581783774171455},
            {2037.5, 0.0015677006032786467},
            {2062.5, 0.0015536174323858383},
            {2087.5, 0.00153953426149303},
            {2112.5, 0.0015254510906002217},
            {2137.5, 0.0015113679197074133},
            {2162.5, 0.001497284748814605},
            {2187.5, 0.0014831549346792806},
            {2212.5, 0.0014689897641067425},
            {2237.5, 0.0014548245935342042},
            {2262.5, 0.0014406594229616659},
            {2287.5, 0.0014264942523891275},
            {2312.5, 0.0014123290818165895},
            {2337.5, 0.0013981639112440511},
            {2362.5, 0.0013839987406715128},
            {2387.5, 0.0013713524744704579},
            {2412.5, 0.0013588735758556765},
            {2437.5, 0.0013463946772408952},
            {2462.5, 0.001333915778626114},
            {2487.5, 0.0013214368800113327},
            {2512.5, 0.0013089579813965514},
            {2537.5, 0.0012964790827817703},
            {2562.5, 0.001284000184166989},
            {2587.5, 0.0012779837673194063},
            {2612.5, 0.0012737720690322429},
            {2637.5, 0.0012695603707450797},
            {2662.5, 0.0012653486724579163},
            {2687.5, 0.001261136974170753},
            {2712.5, 0.0012569252758835895},
            {2737.5, 0.0012527135775964263},
            {2762.5, 0.001248501879309263},
            {2787.5, 0.001246427007913022},
            {2812.5, 0.001252188051307776},
            {2837.5, 0.00125794909470253},
            {2862.5, 0.001263710138097284},
            {2887.5, 0.001269471181492038},
            {2912.5, 0.001275232224886792},
            {2937.5, 0.001280993268281546},
            {2962.5, 0.0012867543116763},
            {2987.5, 0.001292515355071054},
            {3012.5, 0.0013000702817801398},
            {3037.5, 0.0013145573759507914},
            {3062.5, 0.0013290444701214428},
            {3087.5, 0.0013435315642920944},
            {3112.5, 0.0013580186584627458},
            {3137.5, 0.0013725057526333974},
            {3162.5, 0.0013869928468040488},
            {3187.5, 0.0014014799409747005},
            {3212.5, 0.0014159670351453519},
            {3237.5, 0.0014304541293160035},
            {3262.5, 0.001445975261042732},
            {3287.5, 0.0014618112656292633},
            {3312.5, 0.0014776472702157945},
            {3337.5, 0.001493483274802326},
            {3362.5, 0.0015093192793888572},
            {3387.5, 0.0015251552839753886},
            {3412.5, 0.0015409912885619198},
            {3437.5, 0.0015568272931484513},
            {3462.5, 0.0015726632977349825},
            {3487.5, 0.001588499302321514},
            {3512.5, 0.001600768734414785},
            {3537.5, 0.0016126911694868656},
            {3562.5, 0.001624613604558946},
            {3587.5, 0.0016365360396310266},
            {3612.5, 0.0016484584747031071},
            {3637.5, 0.0016603809097751876},
            {3662.5, 0.0016723033448472681},
            {3687.5, 0.0016842257799193486},
            {3712.5, 0.0016961482149914291},
            {3737.5, 0.0017080706500635099},
            {3762.5, 0.0017138165989064352},
            {3787.5, 0.0017163571617625386},
            {3812.5, 0.001718897724618642},
            {3837.5, 0.0017214382874747454},
            {3862.5, 0.0017239788503308488},
            {3887.5, 0.0017265194131869522},
            {3912.5, 0.0017290599760430556},
            {3937.5, 0.0017316005388991588},
            {3962.5, 0.0017341411017552622},
            {3987.5, 0.0017366816646113656}
        };
        
        // Linear interpolation function, performs linear interpolation between data points
        // For heights between measured points, it calculates sh using:
        // sh = sh1 + (sh2 - sh1) * (z - z1) / (z2 - z1)
        auto interpolate = [&](scalar z) -> scalar
        {
            // Handle heights below minimum data point
            if (z <= profileData.first().first()) 
                return profileData.first().second();
            
            // Handle heights above maximum data point  
            if (z >= profileData.last().first()) 
                return profileData.last().second();
                
            // Find the interval that contains this z-value
            for (label i = 0; i < profileData.size() - 1; ++i)
            {
                if (z >= profileData[i].first() && z <= profileData[i+1].first())
                {
                    scalar z1 = profileData[i].first();
                    scalar z2 = profileData[i+1].first();
                    scalar sh1 = profileData[i].second();
                    scalar sh2 = profileData[i+1].second();
                    
                    // Linear interpolation formula
                    return sh1 + (sh2 - sh1) * (z - z1) / (z2 - z1);
                }
            }
            
            // Fallback - return last value
            return profileData.last().second();
        };

        // Assign temperature to each cell based on its z-coordinate (vertical)
        forAll(sh, i)
        {
            const scalar z = mesh.C()[i].z(); // Now using z as vertical coordinate
            sh[i] = interpolate(z);
        }        
        sh.writeEntry("", os);
    #};
};

boundaryField
{
    earth
    {
        type            atmTurbulentMoistureFluxHumidity; // surface moisture flux
        MoistureSource  flux;
        gammaEff        gammaEff; // coming from the solver buoyantBoussinesqHumidityPimpleFoam/shEqn.H (Line 8): volScalarField gammaEff("gammaEff", turbulence->nu()/Sch + gammat);
        value           uniform 0.009190666329739507; // surface specific humidity at IC, interpolated from 0/sh: {12.5, 0.009130094115766754},{37.5, 0.009008949687821247}
        MoistureFlux    csvFile; // Kinematic moisture flux in kg/kg·m/s unit for 12 hours, from 0s to 43100s.
        nHeaderLine     1;
        refColumn       0;
        componentColumns ( 1 );
        separator       ",";
        mergeSeparators no;
        file            "<constant>/qt_sbot_in_clear_sky_input.csv";
    }
    cblTop
    {
        type            zeroGradient;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
